Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP64MU506.h
#define _RPINR40_DTCMP5R4_POSITION               0x0000000C
#define _RPINR40_DTCMP5R4_MASK                   0x00001000
#define _RPINR40_DTCMP5R4_LENGTH                 0x00000001

#define _RPINR40_DTCMP5R5_POSITION               0x0000000D
#define _RPINR40_DTCMP5R5_MASK                   0x00002000
#define _RPINR40_DTCMP5R5_LENGTH                 0x00000001

#define _RPINR40_DTCMP5R6_POSITION               0x0000000E
#define _RPINR40_DTCMP5R6_MASK                   0x00004000
#define _RPINR40_DTCMP5R6_LENGTH                 0x00000001

#define _RPINR41_DTCMP6R_POSITION                0x00000000
#define _RPINR41_DTCMP6R_MASK                    0x0000007F
#define _RPINR41_DTCMP6R_LENGTH                  0x00000007

#define _RPINR41_DTCMP6R0_POSITION               0x00000000
#define _RPINR41_DTCMP6R0_MASK                   0x00000001
#define _RPINR41_DTCMP6R0_LENGTH                 0x00000001

#define _RPINR41_DTCMP6R1_POSITION               0x00000001
#define _RPINR41_DTCMP6R1_MASK                   0x00000002
#define _RPINR41_DTCMP6R1_LENGTH                 0x00000001

#define _RPINR41_DTCMP6R2_POSITION               0x00000002
#define _RPINR41_DTCMP6R2_MASK                   0x00000004
#define _RPINR41_DTCMP6R2_LENGTH                 0x00000001

#define _RPINR41_DTCMP6R3_POSITION               0x00000003
#define _RPINR41_DTCMP6R3_MASK                   0x00000008
#define _RPINR41_DTCMP6R3_LENGTH                 0x00000001

#define _RPINR41_DTCMP6R4_POSITION               0x00000004
#define _RPINR41_DTCMP6R4_MASK                   0x00000010
#define _RPINR41_DTCMP6R4_LENGTH                 0x00000001

#define _RPINR41_DTCMP6R5_POSITION               0x00000005
#define _RPINR41_DTCMP6R5_MASK                   0x00000020
#define _RPINR41_DTCMP6R5_LENGTH                 0x00000001

#define _RPINR41_DTCMP6R6_POSITION               0x00000006
#define _RPINR41_DTCMP6R6_MASK                   0x00000040
#define _RPINR41_DTCMP6R6_LENGTH                 0x00000001

#define _DFCON_DFCMD_POSITION                    0x00000000
#define _DFCON_DFCMD_MASK                        0x00000003
#define _DFCON_DFCMD_LENGTH                      0x00000002

#define _DFCON_DFIPE_POSITION                    0x00000003
#define _DFCON_DFIPE_MASK                        0x00000008
#define _DFCON_DFIPE_LENGTH                      0x00000001

#define _DFCON_DFERR_POSITION                    0x00000004
#define _DFCON_DFERR_MASK                        0x00000030
#define _DFCON_DFERR_LENGTH                      0x00000002

#define _DFCON_DFWREN_POSITION                   0x00000006
#define _DFCON_DFWREN_MASK                       0x00000040
#define _DFCON_DFWREN_LENGTH                     0x00000001

#define _DFCON_DFST_POSITION                     0x00000007
#define _DFCON_DFST_MASK                         0x00000080
#define _DFCON_DFST_LENGTH                       0x00000001

#define _DFCON_DFIDL_POSITION                    0x0000000D
#define _DFCON_DFIDL_MASK                        0x00002000
#define _DFCON_DFIDL_LENGTH                      0x00000001

#define _DFCON_DFRDY_POSITION                    0x0000000E
#define _DFCON_DFRDY_MASK                        0x00004000
#define _DFCON_DFRDY_LENGTH                      0x00000001

#define _DFCON_DFEN_POSITION                     0x0000000F
#define _DFCON_DFEN_MASK                         0x00008000
#define _DFCON_DFEN_LENGTH                       0x00000001

#define _DFCON_DFCMD0_POSITION                   0x00000000
#define _DFCON_DFCMD0_MASK                       0x00000001
#define _DFCON_DFCMD0_LENGTH                     0x00000001

#define _DFCON_DFCMD1_POSITION                   0x00000001
#define _DFCON_DFCMD1_MASK                       0x00000002
#define _DFCON_DFCMD1_LENGTH                     0x00000001

#define _DFCON_DFERR0_POSITION                   0x00000004
#define _DFCON_DFERR0_MASK                       0x00000010
#define _DFCON_DFERR0_LENGTH                     0x00000001

#define _DFCON_DFERR1_POSITION                   0x00000005
#define _DFCON_DFERR1_MASK                       0x00000020
#define _DFCON_DFERR1_LENGTH                     0x00000001

#define _DFADDR_DFADDR_POSITION                  0x00000000
#define _DFADDR_DFADDR_MASK                      0x000001FF
#define _DFADDR_DFADDR_LENGTH                    0x00000009

#define _NVMCON_NVMOP_POSITION                   0x00000000
#define _NVMCON_NVMOP_MASK                       0x0000000F
#define _NVMCON_NVMOP_LENGTH                     0x00000004

#define _NVMCON_URERR_POSITION                   0x00000008
#define _NVMCON_URERR_MASK                       0x00000100
#define _NVMCON_URERR_LENGTH                     0x00000001

#define _NVMCON_RPDF_POSITION                    0x00000009
#define _NVMCON_RPDF_MASK                        0x00000200
#define _NVMCON_RPDF_LENGTH                      0x00000001

#define _NVMCON_NVMSIDL_POSITION                 0x0000000C
#define _NVMCON_NVMSIDL_MASK                     0x00001000
#define _NVMCON_NVMSIDL_LENGTH                   0x00000001

#define _NVMCON_WRERR_POSITION                   0x0000000D
#define _NVMCON_WRERR_MASK                       0x00002000
#define _NVMCON_WRERR_LENGTH                     0x00000001

#define _NVMCON_WREN_POSITION                    0x0000000E
#define _NVMCON_WREN_MASK                        0x00004000
#define _NVMCON_WREN_LENGTH                      0x00000001

#define _NVMCON_WR_POSITION                      0x0000000F
#define _NVMCON_WR_MASK                          0x00008000
#define _NVMCON_WR_LENGTH                        0x00000001

#define _NVMCON_NVMOP0_POSITION                  0x00000000
#define _NVMCON_NVMOP0_MASK                      0x00000001
#define _NVMCON_NVMOP0_LENGTH                    0x00000001

#define _NVMCON_NVMOP1_POSITION                  0x00000001
#define _NVMCON_NVMOP1_MASK                      0x00000002
#define _NVMCON_NVMOP1_LENGTH                    0x00000001

#define _NVMCON_NVMOP2_POSITION                  0x00000002
#define _NVMCON_NVMOP2_MASK                      0x00000004
#define _NVMCON_NVMOP2_LENGTH                    0x00000001

#define _NVMCON_NVMOP3_POSITION                  0x00000003
#define _NVMCON_NVMOP3_MASK                      0x00000008
#define _NVMCON_NVMOP3_LENGTH                    0x00000001

#define _NVMADRH_ADDR_POSITION                   0x00000000
#define _NVMADRH_ADDR_MASK                       0x000000FF
#define _NVMADRH_ADDR_LENGTH                     0x00000008

#define _NVMADRU_ADDR_POSITION                   0x00000000
#define _NVMADRU_ADDR_MASK                       0x000000FF
#define _NVMADRU_ADDR_LENGTH                     0x00000008

#define _RCON_POR_POSITION                       0x00000000
#define _RCON_POR_MASK                           0x00000001
#define _RCON_POR_LENGTH                         0x00000001

